import sqlite3

conn = sqlite3.connect("symbols.db")
cur = conn.cursor()

symbols = [
    ("σ", "シグマ,しぐま", "標準偏差（確率統計）,置換（代数）"),
    ("π", "パイ", "円周率"),
    ("√", "ルート", "平方根"),
    ("∞", "むげん", "無限"),
    ("∫", "インテグラル", "積分"),
    ("∮", "インテグラル", "積分"),

    ("sin", "サイン", "三角関数のひとつ"),
    ("cos", "コサイン", "三角関数のひとつ"),
    ("tan", "タンジェント", "三角関数のひとつ"),
    ("arcsin", "アークサイン", "逆三角関数のひとつ"),
    ("arccos", "アークコサイン", "逆三角関数のひとつ"),
    ("arctan", "アークタンジェント", "逆三角関数のひとつ"),

    ("inf（infimum）", "インフ", "下界"),
    ("sup（supremum）", "スープ", "上界"),
    ("min（mimimum）", "ミン,ミニマム", "最小,下限"),
    ("min（minute）", "ミニット", "分"),
    ("max（maximum）", "マックス", "最大,上限"),

    ("⊆", "A⊆BでAはBに含まれる,部分集合", "部分集合(A=BまたはA⊂B)"),
    ("⊂", "A⊆BでAはBに含まれる,（真）部分集合", "（真）部分集合"),
    ("∈", "A∈BでAはBに属する,Bの元（要素）", "元（要素）が集合に属する"),
    ("∪", "カップ,和集合", "和集合"),
    ("∩", "キャップ,共通部分", "共通部分"),
    ("c,-", "補集合", "補集合"),

    ("N（太文字）", "自然数", "1、2、3、、、、"),
    ("Z（太文字）", "整数", "、、、、-3、-2、-1、0、1、2、3、、、、"),
    ("Q（太文字）", "有理数", "自然数、整数、有限小数、循環小数など（2つの整数m、nを使ってm/nと表せる数）"),
    ("Z-Q（太文字）", "無理数", "√2、πなど（2つの整数m、nを使ってm/nと表せない数）"),
    ("R（太文字）", "実数", "有理数、無理数を含む"),
    ("C（太文字）", "複素数", "実数と虚数を組み合わせた数"),
    ("i", "アイ", "虚数単位"),
    ("Re（Real part）", "アールイー", "実部"),
    ("Im（Imaginary part）", "アイエム", "虚部"),

    # ギリシャ小文字
    ("α", "アルファ", "角度,係数,未知数"),
    ("β", "ベータ", "係数,回帰係数,放射線の種類"),
    ("γ", "ガンマ", "角度,係数,ガンマ関数"),
    ("δ", "デルタ", "変化量,微小量"),
    ("ε", "イプシロン", "微小量,誤差"),
    ("ζ", "ゼータ", "変数,係数"),
    ("η", "イータ", "効率,変数"),
    ("θ", "シータ", "角度"),
    ("ι", "イオタ", "添字,小さな量"),
    ("κ", "カッパ", "定数,曲率"),
    ("λ", "ラムダ", "固有値,波長"),
    ("μ", "ミュー", "平均値,マイクロ"),
    ("ν", "ニュー", "周波数,変数"),
    ("ξ", "クシー", "変数"),
    ("ο", "オミクロン", "ほぼ使わない"),
    ("π", "パイ", "円周率"),
    ("ρ", "ロー", "密度,相関係数"),

    ("τ", "タウ", "時間定数,トルク"),
    ("υ", "ユプシロン", "ほぼ使わない"),
    ("φ", "ファイ", "角度,位相"),
    ("χ", "カイ", "カイ二乗分布"),
    ("ψ", "プサイ", "波動関数"),
    ("ω", "オメガ", "角速度,最後の要素"),

    # ギリシャ大文字
    ("Α", "アルファ", "係数"),
    ("Β", "ベータ", "係数"),
    ("Γ", "ガンマ", "ガンマ関数,角度"),
    ("Δ", "デルタ", "変化量"),
    ("Ε", "イプシロン", "集合（まれ）"),
    ("Ζ", "ゼータ", "変数"),
    ("Η", "イータ", "効率"),
    ("Θ", "シータ", "角度"),
    ("Ι", "イオタ", "添字"),
    ("Κ", "カッパ", "定数"),
    ("Λ", "ラムダ", "固有値"),
    ("Μ", "ミュー", "平均"),
    ("Ν", "ニュー", "変数"),
    ("Ξ", "クシー", "変数"),
    ("Ο", "オミクロン", "ほぼ使わない"),
    ("Π", "パイ", "総積"),
    ("Ρ", "ロー", "変数"),
    ("Σ", "シグマ", "総和"),
    ("Τ", "タウ", "時間"),
    ("Υ", "ユプシロン", "変数"),
    ("Φ", "ファイ", "位相,空集合（集合論）"),
    ("Χ", "カイ", "変数"),
    ("Ψ", "プサイ", "波動関数"),
    ("Ω", "オメガ", "角速度,終端"),
]

cur.executemany("""
INSERT INTO symbols (name, readings, meanings)
VALUES (?, ?, ?)
""", symbols)

conn.commit()
conn.close()

print("データ追加完了")